# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]
# ls_1 = [1, 2, 4, 0]
# ls_2 = []
# for i in ls_1.copy():
#     i *= i
#     ls_2.append(i)
# print(ls_2)


# ls_1 = []
# ls_2 = []
# for i in range(0,10,2):
#     ls_1.append(i)
# for i in ls_1.copy():
#     i = i * i
#     ls_2.append(i)
# print(ls_1, ls_2)




# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.


# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4